{
  "backend/main.mo": "Main backend actor implementing an e-commerce system with product catalog, shopping cart, orders, user profiles, and admin functionality using role-based access control with Internet Identity authentication.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (homepage, product listing, product details, cart, checkout, admin interface) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend files including components, pages, hooks, and configuration files for the e-commerce application.",
  "frontend/index.css": "Global Tailwind CSS styles defining a warm earth tone color palette in OKLCH format with light and dark mode support for the application theme.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, cart, checkout, order confirmation, and admin pages.",
  "frontend/src/components/AdminOrdersList.tsx": "Admin component displaying a table of orders with customer information, item count, and total amount in a card layout.",
  "frontend/src/components/AdminProductForm.tsx": "Dialog form component for adding and editing products with fields for name, description, price, category, size selection checkboxes, and image picker.",
  "frontend/src/components/AdminProductTable.tsx": "Displays a table of products with edit and delete actions for admin users, including a confirmation dialog for deletions. Shows product images, names, categories, prices, and available sizes in a structured table format.",
  "frontend/src/components/CartIcon.tsx": "Renders a shopping bag icon with a badge showing the total number of items in the cart. Navigates to the cart page when clicked.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product details, size, quantity controls (increment/decrement), and a remove button. Calculates and shows the subtotal for the item.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with logo, navigation links for shop categories and customer service, social media icons, and copyright information. Includes a \"Built with caffeine.ai\" attribution link.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, category links (Men/Women/Kids), cart icon, and login/logout button. Shows an Admin button for authenticated admin users.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header and Footer, using Outlet for nested route rendering. Provides consistent page structure with flex layout.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, and category badge. Navigates to product detail page on click or button press.",
  "frontend/src/components/ProductFilters.tsx": "Provides filtering UI for products with category checkboxes, price range slider, and clear filters button. Shows product counts per category.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards routes requiring authentication and admin privileges, showing appropriate login or access denied messages. Displays loading states during authentication checks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useAuth.ts": "Exports useIsAdmin hook that queries the backend actor to check if the current authenticated user has admin privileges.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for cart operations: fetching cart items, adding/removing items, and clearing the cart, all with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and delegation handling for ICP authentication.",
  "frontend/src/hooks/useOrders.ts": "Exports hooks for placing orders with customer info and fetching user orders, with automatic cart and orders cache invalidation.",
  "frontend/src/hooks/useProduct.ts": "Provides a hook to fetch a single product by ID from the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Exports hooks for product CRUD operations: fetching all products, filtering by category, adding, updating, and deleting products with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom warm earth-tone color palette (terracotta, sand, olive) for both light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin dashboard page with tabs for managing products (add/edit/delete) and viewing orders, using forms, tables, and toast notifications.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, order summary with total calculation, and checkout navigation with empty state handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page component that displays a shipping information form using react-hook-form, shows order summary with cart items and total, and handles order placement with navigation to confirmation page.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a hero banner section, featured products grid (first 6 products), and category navigation cards for Men, Women, and Kids collections.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that displays a success message with order ID from URL search params and provides navigation buttons to continue shopping or return home.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing product image, description, price, size selection, quantity picker, and add-to-cart functionality with authentication check before adding items.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with filtering by category and price range, displays product count, supports both desktop sidebar and mobile sheet filters, and shows filtered products in a grid layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter and Playfair Display), container queries, typography plugin, and animation keyframes for accordions and other UI components.",
  "project_state.json": "Project state file for Aadi Shop e-commerce clothing store tracking 7 existing features (homepage, product listing, cart, checkout, admin interface) and 3 pending backend features (product catalog, order management), along with required image assets and design specifications."
}